Revit 2027 API
Selection.PickBox Method
Overload List
Name | Description
PickBox(PickBoxStyle) |  Invokes a general purpose two-click editor that lets the user to specify a rectangular area on the screen.
PickBox(PickBoxStyle, String) |  Invokes a general purpose two-click editor that lets the user to specify a rectangular area on the screen.
Top
See Also
Reference
Selection Class
Autodesk.Revit.UI.Selection Namespace